ИТ_Фирма/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИТ_Фирма/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

ИТ_Фирма/src/Catalogs/Контрагенты/ObjectModule.bsl
Функция ТолькоЦифрыВСтроке(ИНН) 
	
	Цифры = "0123456789";
	
	Для СчИНН = 1 По СтрДлина(ИНН) Цикл
		
		Символ = Сред(ИНН, СчИНН, 1);
		
		Если СтрНайти(Цифры, Символ) = 0 Тогда 
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
Функция ТолькоЦифрыВСтроке1(КПП)
	
	Цифры = "0123456789";
	
	Для СчКПП = 1 По СтрДлина(КПП) Цикл
		
		Символ = Сред(КПП, СчКПП, 1);
		
		Если СтрНайти(Цифры, Символ) = 0 Тогда 
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();

КонецПроцедуры

Процедура ОбработкапроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты)
	
	// Проверка корректного заполнения ИНН и КПП
	
	ЭтоЮридическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	ЭтоФизическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	ДлинаИНН = СтрДлина(ИНН);
	
	ДлинаКПП = СтрДлина(КПП);	
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Отказ = Ложь;
	
	ИначеЕсли ЗначениеЗаполнено(ИНН) и ЭтоЮридическоеЛицо Тогда
		
		
		
		Если  ДлинаИНН <> 10 
			
			Или Не ЗначениеЗаполнено(ИНН) Тогда 
			
			Отказ = Истина;	
			
			Сообщить("ИНН у юридического лица должен быть заполнен и иметь длину 10 символов");
			
		ИначеЕсли Не ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Отказ = Истина;
			
			Сообщить("ИНН должен состоять только из цифр");
			
		ИначеЕсли РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда 
			
			Отказ = Истина;
			
			Сообщить("Контрольная проверка не пройдена");
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(КПП) 
			
			Или ДлинаКПП <>9 Тогда
			
			Отказ = Истина;
			
			Сообщить("Необходимо заполнить КПП, его длина должна быть 9 символов");	
			
		ИначеЕсли Не ТолькоЦифрыВСтроке1(КПП) Тогда 
			
			Отказ = Истина;
			
			Сообщить("КПП должен состоять только из цифр");
			
		КонецЕсли;	
		
		
	Иначе 
		
		Если ДлинаИНН <> 12 Или Не ЗначениеЗаполнено(ИНН) Тогда 
			
			Отказ = Истина;	
			
			Сообщить ("Значение ИНН должно быть заполнено и иметь длину 12 символов");
			
		ИначеЕсли Не ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Отказ = Истина;
			
			Сообщить("ИНН должен состоять только из цифр");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПП) Тогда
			
			Отказ = Истина;	
			
			Сообщить("Поле КПП должно быть пустым");
			
		КонецЕсли;	
		
	КонецЕсли;
		
	КонецПроцедуры
